# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses, count = 10000, 12000, 0

while count < 9:
    count += 1
    expenses += expenses * 0.03 + 12000
    if count > 9:
        break
money = round(expenses - educational_grant * 10, 2)
print('Студенту надо попросить', money, 'рублей')
